program start
seed set
[PhysicalDevice(name='/physical_device:GPU:0', device_type='GPU')]
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 150, 150, 7) 0                                            
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 150, 150, 7)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 150, 150, 32) 2048        lambda[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 75, 75, 32)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 75, 75, 7)    0           lambda[0][0]                     
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 75, 75, 7)    0           lambda[0][0]                     
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 75, 75, 7)    0           lambda[0][0]                     
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 75, 75, 7)    0           lambda[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 75, 75, 32)   9248        max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 75, 75, 32)   2048        lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 75, 75, 32)   2048        lambda_2[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 75, 75, 32)   2048        lambda_3[0][0]                   
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 75, 75, 32)   2048        lambda_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 38, 38, 32)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 38, 38, 32)   0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 38, 38, 32)   0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 38, 38, 32)   0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 38, 38, 32)   0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 38, 38, 64)   18496       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 38, 38, 64)   18496       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 38, 38, 64)   18496       max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 38, 38, 64)   18496       max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 38, 38, 64)   18496       max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 19, 19, 64)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 19, 19, 64)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 19, 19, 64)   0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 19, 19, 64)   0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 19, 19, 64)   0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 19, 19, 128)  73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 19, 19, 128)  73856       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 19, 19, 128)  73856       max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 19, 19, 128)  73856       max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 19, 19, 128)  73856       max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 10, 10, 128)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 10, 10, 128)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 10, 10, 128)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 10, 10, 128)  0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 10, 10, 128)  0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10, 10, 640)  0           max_pooling2d_3[0][0]            
                                                                 max_pooling2d_6[0][0]            
                                                                 max_pooling2d_9[0][0]            
                                                                 max_pooling2d_12[0][0]           
                                                                 max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
flatten (Flatten)               (None, 64000)        0           concatenate[0][0]                
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         65537024    flatten[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         1049600     dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 5)            5125        dropout_1[0][0]                  
==================================================================================================
Total params: 67,072,997
Trainable params: 67,072,997
Non-trainable params: 0
__________________________________________________________________________________________________
Start loading dataset with augmentation...
Load "Big" complete
Load "Long" complete
Load "Mitotic" complete
